Repository: StanfordSpezi/Spezi
Catalog: Sources/FirebaseAccount/Resources/*.lproj/Localizable.strings
Languages: de

# FIREBASE_ACCOUNT_DEFAULT_PASSWORD_RULE_ERROR
source: A password has to have at least eight characters and no whitespaces.
de: Ein Password muss mindestens acht Zeichen und keine Leerzeichen haben.

# FIREBASE_ACCOUNT_ERROR_INVALID_EMAIL
source: Invalid email address
de: Inkorrekte E-Mail Adresse

# FIREBASE_ACCOUNT_ERROR_INVALID_EMAIL_SUGGESTION
source: Please enter a valid email address.
de: Bitte geben Sie eine korrekte E-Mail Adressse ein.

# FIREBASE_ACCOUNT_ALREADY_IN_USE
source: Account already exists
de: Benutzerkonto existiert bereits

# FIREBASE_ACCOUNT_ALREADY_IN_USE_SUGGESTION
source: An account with this email already exists. Please login using your email and password.
de: Ein Benutzerkonto mit dieser E-Mail Adresse existiert bereits. Bitte loggen Sie sich mit dem Account ein.

# FIREBASE_ACCOUNT_WEAK_PASSWORD
source: Weak Password
de: Schwaches Passwort

# FIREBASE_ACCOUNT_WEAK_PASSWORD_SUGGESTION
source: Please choose a safer password.
de: Bitte geben Sie ein stärkeres Password ein.

# FIREBASE_ACCOUNT_SETUP_ERROR
source: Could not create the user account.
de: Benutzerkonto konnte nicht erstelle werden

# FIREBASE_ACCOUNT_SETUP_ERROR_SUGGESTION
source: Please check your internet connection and try again.
de: Bitte überprüfen Sie Ihre E-Mail Adresse und versichen Sie es erneut

# FIREBASE_ACCOUNT_UNKNOWN
source: Could not create the user account.
de: Benutzerkonto konnte nicht erstelle werden

# FIREBASE_ACCOUNT_UNKNOWN_SUGGESTION
source: Please check your internet connection and try again.
de: Bitte überprüfen Sie Ihre E-Mail Adresse und versichen Sie es erneut
